sparkfun/Pioneer_IoT_Kit_Shield/Firmware/BLE_To_RPi/BLE_To_RPi.cydsn/Generated_Source/PSoC6/CapSense_SensingCSD_LL.h
/***************************************************************************//**
* \file CapSense_SensingCSD_LL.h
* \version 1.0
*
* \brief
*   This file provides the headers of APIs specific to CSD sensing implementation.
*
* \see CapSense v1.0 Datasheet
*
*//*****************************************************************************
* Copyright (2016-2017), Cypress Semiconductor Corporation.
********************************************************************************
* This software is owned by Cypress Semiconductor Corporation (Cypress) and is
* protected by and subject to worldwide patent protection (United States and
* foreign), United States copyright laws and international treaty provisions.
* Cypress hereby grants to licensee a personal, non-exclusive, non-transferable
* license to copy, use, modify, create derivative works of, and compile the
* Cypress Source Code and derivative works for the sole purpose of creating
* custom software in support of licensee product to be used only in conjunction
* with a Cypress integrated circuit as specified in the applicable agreement.
* Any reproduction, modification, translation, compilation, or representation of
* this software except as specified above is prohibited without the express
* written permission of Cypress.
*
* Disclaimer: CYPRESS MAKES NO WARRANTY OF ANY KIND, EXPRESS OR IMPLIED, WITH
* REGARD TO THIS MATERIAL, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
* WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE.
* Cypress reserves the right to make changes without further notice to the
* materials described herein. Cypress does not assume any liability arising out
* of the application or use of any product or circuit described herein. Cypress
* does not authorize its products for use as critical components in life-support
* systems where a malfunction or failure may reasonably be expected to result in
* significant injury to the user. The inclusion of Cypress' product in a life-
* support systems application implies that the manufacturer assumes all risk of
* such use and in doing so indemnifies Cypress against all charges. Use may be
* limited by and subject to the applicable Cypress software license agreement.
*******************************************************************************/

#if !defined(CY_CAPSENSE_CapSense_SENSINGCSD_LL_H)
#define CY_CAPSENSE_CapSense_SENSINGCSD_LL_H

#include "cyfitter_gpio.h"
#include "syslib/cy_syslib.h"
#include "CapSense_Structure.h"
#include "CapSense_Configuration.h"

/****************************************************************************
* Register and mode mask definition
****************************************************************************/


/* CMOD and CSH capacitor port-pins registers */
#if (CapSense_ENABLE == CapSense_CSD_EN)

    #if ((CapSense_ENABLE == CapSense_CSD_SHIELD_EN) && \
         (CapSense_ENABLE == CapSense_CSD_SHIELD_TANK_EN))
        #define CapSense_CTANK_CONNECTION                   (CapSense_CSD__DEDICATED_IO1)
    #endif /* ((CapSense_ENABLE == CapSense_CSD_SHIELD_EN) && \
               (CapSense_ENABLE == CapSense_CSD_SHIELD_TANK_EN)) */

    #if(0u != CapSense_CSX_EN)
        #define CapSense_CMOD_CONNECTION                    (CapSense_CSD__CSHIELD_PAD)
    #else
        #define CapSense_CMOD_CONNECTION                    (CapSense_CSD__DEDICATED_IO0)
    #endif /* (0u != CapSense_CSX_EN) */

    #define CapSense_CSD_CMOD_PORT_PTR                      (CapSense_Cmod_0_PORT)
    #define CapSense_CSD_CMOD_PIN                           (CapSense_Cmod_0_NUM)

    #define CapSense_CSD_CTANK_PORT_PTR                     (CapSense_Csh_0_PORT)
    #define CapSense_CSD_CTANK_PIN                          (CapSense_Csh_0_NUM)

#endif  /* (CapSense_ENABLE == CapSense_CSD_EN) */

#define CapSense_CSD_CSDCMP_INIT                                (CapSense_CSD_CSDCMP_CSDCMP_DISABLED)

/* SW_HS_P_SEL switches state for Coarse initialization of CMOD (sense path) */
#if (CapSense_ENABLE == CapSense_CSD_EN)
    #if (CapSense_CSD__CMOD_PAD == CapSense_CMOD_CONNECTION)
        #define CapSense_CSD_HS_P_SEL_COARSE_CMOD               (CapSense_CSD_SW_HS_P_SEL_SW_HMPM_STATIC_CLOSE)
    #elif (CapSense_CSD__CSHIELD_PAD == CapSense_CMOD_CONNECTION)
        #define CapSense_CSD_HS_P_SEL_COARSE_CMOD               (CapSense_CSD_SW_HS_P_SEL_SW_HMPS_STATIC_CLOSE)
    #else
        #define CapSense_CSD_HS_P_SEL_COARSE_CMOD               (CapSense_CSD_SW_HS_P_SEL_SW_HMPT_STATIC_CLOSE)
    #endif /* (CapSense_CSD__CMOD_PAD == CapSense_CMOD_CONNECTION) */
#else
    #define CapSense_CSD_HS_P_SEL_COARSE_CMOD                   (0x00000000uL)
#endif /* ((CapSense_ENABLE == CapSense_CSD_CSX_EN) && (CapSense_ENABLE == CapSense_CSD_EN)) */

#if ((CapSense_ENABLE == CapSense_CSD_SHIELD_TANK_EN) && \
    (CapSense_ENABLE == CapSense_CSD_SHIELD_EN))
    /* SW_HS_P_SEL switches state for Coarse initialization of CTANK (sense path) */
    #if (CapSense_CSD__CSH_TANK_PAD == CapSense_CTANK_CONNECTION)
        #define CapSense_CSD_HS_P_SEL_COARSE_TANK               (CapSense_CSD_SW_HS_P_SEL_SW_HMPT_STATIC_CLOSE)
    #elif (CapSense_CSD__CSHIELD_PAD == CapSense_CTANK_CONNECTION)
        #define CapSense_CSD_HS_P_SEL_COARSE_TANK               (CapSense_CSD_SW_HS_P_SEL_SW_HMPS_STATIC_CLOSE)
    #elif (CapSense_CSD__CMOD_PAD == CapSense_CTANK_CONNECTION)
        #define CapSense_CSD_HS_P_SEL_COARSE_TANK               (CapSense_CSD_SW_HS_P_SEL_SW_HMPM_STATIC_CLOSE)
    #else
        #define CapSense_CSD_HS_P_SEL_COARSE_TANK               (CapSense_CSD_SW_HS_P_SEL_SW_HMMA_STATIC_CLOSE)
    #endif /* (CapSense_CSD__CSH_TANK_PAD == CapSense_CTANK_CONNECTION) */
#else
    #define CapSense_CSD_HS_P_SEL_COARSE_TANK                   (0x00000000uL)
#endif /* ((CapSense_ENABLE == CapSense_CSD_SHIELD_TANK_EN) && \
           (CapSense_ENABLE == CapSense_CSD_SHIELD_EN)) */

#define CapSense_CSD_SW_HS_P_SEL_COARSE                         (CapSense_CSD_HS_P_SEL_COARSE_CMOD | CapSense_CSD_HS_P_SEL_COARSE_TANK)

/* C_mod config */
#if ((CapSense_CSD__CMOD_PAD == CapSense_CMOD_CONNECTION) || (CapSense_CSD__CMOD_PAD == CapSense_CTANK_CONNECTION))
    #define CapSense_CSD_SW_FW_MOD_SEL_INIT             (CapSense_CSD_SW_FW_MOD_SEL_SW_F1PM_STATIC_CLOSE |\
                                                                 CapSense_CSD_SW_FW_MOD_SEL_SW_F1MA_STATIC_CLOSE |\
                                                                 CapSense_CSD_SW_FW_MOD_SEL_SW_F1CA_STATIC_CLOSE)
#else
    #define CapSense_CSD_SW_FW_MOD_SEL_INIT             (0x00000000uL)
#endif /* (CapSense_CSD__CMOD_PAD == CapSense_CMOD_CONNECTION) */

/* C_tank config */
#if ((CapSense_CSD__CSH_TANK_PAD == CapSense_CMOD_CONNECTION) || (CapSense_CSD__CSH_TANK_PAD == CapSense_CTANK_CONNECTION))
    #define CapSense_CSD_SW_FW_TANK_SEL_INIT            (CapSense_CSD_SW_FW_TANK_SEL_SW_F2PT_STATIC_CLOSE |\
                                                                 CapSense_CSD_SW_FW_TANK_SEL_SW_F2MA_STATIC_CLOSE |\
                                                                 CapSense_CSD_SW_FW_TANK_SEL_SW_F2CA_STATIC_CLOSE)
#else
    #define CapSense_CSD_SW_FW_TANK_SEL_INIT            (0x00000000uL)
#endif /* (CapSense_CSD__CSH_TANK_PAD == CapSense_CTANK_CONNECTION) */

#define CapSense_CSD_SW_SHIELD_SEL_INIT                 (CapSense_CSD_SW_SHIELD_SEL_SW_HCAV_HSCMP)

#if(CapSense_CSD_IREF_SRSS != CapSense_CSD_IREF_SOURCE)
    #define CapSense_IREF_SRC_CFG   (CSD_CONFIG_IREF_SEL_Msk)
#else
    #define CapSense_IREF_SRC_CFG   (0u)
#endif /* (CapSense_CSD_IREF_SRSS != CapSense_CSD_IREF_SOURCE) */

#if(CapSense_ENABLE != CapSense_LP_MODE_EN)
    #define CapSense_PWR_MODE_CFG   (0u)
#else
    #define CapSense_PWR_MODE_CFG   (CSD_CONFIG_LP_MODE_Msk)
#endif /* (CapSense_ENABLE != CapSense_LP_MODE_EN) */

/* Defining default CSDv2 configuration according to settings in customizer. */
#define CapSense_DEFAULT_CSD_CONFIG                 (CapSense_CSD_CONFIG_FILTER_DELAY_12MHZ |\
                                                             CapSense_IREF_SRC_CFG |\
                                                             CapSense_PWR_MODE_CFG)

#if(CapSense_SENSING_LEGACY == CapSense_CSD_SENSING_METHOD)

    #if (CapSense_ENABLE == CapSense_CSD_AUTO_ZERO_EN)
        /* Enable CSDCMP */
        #define CapSense_CSD_CSDCMP_SCAN                (CapSense_CSD_CSDCMP_CSDCMP_EN_MSK |\
                                                                 CapSense_CSD_CSDCMP_AZ_EN_MSK)
    #else
        /* Enable CSDCMP */
        #define CapSense_CSD_CSDCMP_SCAN                (CapSense_CSD_CSDCMP_CSDCMP_EN_MSK)
    #endif /* (CapSense_ENABLE == CapSense_CSD_AUTO_ZERO_EN) */

    #if ((CapSense_ENABLE == CapSense_CSD_SHIELD_TANK_EN) && \
        (CapSense_ENABLE == CapSense_CSD_SHIELD_EN))
        /* SW_HS_P_SEL switches state for Coarse initialization of CTANK (sense path) */
        #if (CapSense_CSD__CSH_TANK_PAD == CapSense_CTANK_CONNECTION)
            #define CapSense_CSD_HS_P_SEL_SCAN_TANK                 (CapSense_CSD_SW_HS_P_SEL_SW_HMPT_STATIC_CLOSE)
        #elif (CapSense_CSD__CSHIELD_PAD == CapSense_CTANK_CONNECTION)
            #define CapSense_CSD_HS_P_SEL_SCAN_TANK                 (CapSense_CSD_SW_HS_P_SEL_SW_HMPS_STATIC_CLOSE)
        #elif (CapSense_CSD__CMOD_PAD == CapSense_CTANK_CONNECTION)
            #define CapSense_CSD_HS_P_SEL_SCAN_TANK                 (CapSense_CSD_SW_HS_P_SEL_SW_HMPM_STATIC_CLOSE)
        #else
            #define CapSense_CSD_HS_P_SEL_SCAN_TANK                 (CapSense_CSD_SW_HS_P_SEL_SW_HMMB_STATIC_CLOSE)
        #endif /* (CapSense_CSD__CSH_TANK_PAD == CapSense_CTANK_CONNECTION) */
        #define CapSense_CSD_SW_HS_P_SEL_SCAN                       (CapSense_CSD_HS_P_SEL_SCAN_TANK)
    #elif(CapSense_ENABLE == CapSense_CSD_SHIELD_EN)
        #define CapSense_CSD_SW_HS_P_SEL_SCAN                       (CapSense_CSD_SW_HS_P_SEL_SW_HMMB_STATIC_CLOSE)
    #else
        #define CapSense_CSD_SW_HS_P_SEL_SCAN                       (CapSense_CSD_WAVEFORM_STATIC_OPEN)
    #endif /* ((CapSense_ENABLE == CapSense_CSD_SHIELD_TANK_EN) && \
               (CapSense_ENABLE == CapSense_CSD_SHIELD_EN)) */

    /* SW_FW_MOD_SEL switches state for Coarse initialization of CMOD (sense path) */
    #define CapSense_CSD_SW_FW_MOD_SEL_SCAN                 (0x00000000uL)

    #if((CapSense_ENABLE == CapSense_CSD_SHIELD_EN) && \
        (CapSense_ENABLE == CapSense_CSD_SHIELD_TANK_EN) && \
        (CapSense_CSD__CSH_TANK_PAD == CapSense_CTANK_CONNECTION))
        #define CapSense_CSD_SW_FW_TANK_SEL_SCAN            (CapSense_CSD_SW_FW_TANK_SEL_SW_F2PT_STATIC_CLOSE | \
                                                                 CapSense_CSD_SW_FW_TANK_SEL_SW_F2CB_STATIC_CLOSE)
    #else
        #define CapSense_CSD_SW_FW_TANK_SEL_SCAN            (0x00000000uL)
    #endif /* ((CapSense_ENABLE == CapSense_CSD_SHIELD_EN) && \
               (CapSense_ENABLE == CapSense_CSD_SHIELD_TANK_EN) && \
               (CapSense_CSD__CSH_TANK_PAD == CapSense_CTANK_CONNECTION)) */

    /* Shield switch default config */
    #if ((CapSense_ENABLE == CapSense_CSD_SHIELD_EN) && \
         (CapSense_ENABLE == CapSense_CSD_SHIELD_TANK_EN))
        #if (CapSense_IDAC_SINKING == CapSense_CSD_IDAC_CONFIG)
            #define CapSense_CSD_SW_SHIELD_SEL_SCAN          (CapSense_CSD_SW_SHIELD_SEL_SW_HCBG_HSCMP)
        #else
            #define CapSense_CSD_SW_SHIELD_SEL_SCAN          (CapSense_CSD_SW_SHIELD_SEL_SW_HCBV_HSCMP)
        #endif /* (CapSense_IDAC_SINKING == CapSense_CSD_IDAC_CONFIG) */
    #elif(CapSense_ENABLE == CapSense_CSD_SHIELD_EN)
        #if (CapSense_IDAC_SINKING == CapSense_CSD_IDAC_CONFIG)
            #define CapSense_CSD_SW_SHIELD_SEL_SCAN          (CapSense_CSD_SW_SHIELD_SEL_SW_HCBV_PHI1 | \
                                                                     CapSense_CSD_SW_SHIELD_SEL_SW_HCBG_PHI2_HSCMP)
        #else
            #define CapSense_CSD_SW_SHIELD_SEL_SCAN          (CapSense_CSD_SW_SHIELD_SEL_SW_HCBG_PHI1 | \
                                                                     CapSense_CSD_SW_SHIELD_SEL_SW_HCBV_PHI2_HSCMP)
        #endif /* (CapSense_IDAC_SINKING == CapSense_CSD_IDAC_CONFIG) */
    #else
        #define CapSense_CSD_SW_SHIELD_SEL_SCAN              (0x00000000uL)
    #endif /* ((CapSense_ENABLE == CapSense_CSD_SHIELD_EN) && \
               (CapSense_ENABLE == CapSense_CSD_SHIELD_TANK_EN)) */

