sparkfun/Pioneer_IoT_Kit_Shield/Firmware/BLE_To_RPi/BLE_To_RPi.cydsn/Generated_Source/PSoC6/CapSense_SensingCSD_LL.h
    #define CapSense_CSD_SW_RES_INIT                        (CapSense_CSD_INIT_SWITCH_RES << CSD_SW_RES_RES_HCAV_Pos)
    #define CapSense_CSD_SW_RES_SCAN                        ((CapSense_CSD_SHIELD_SWITCH_RES << CSD_SW_RES_RES_HCBV_Pos) |\
                                                                     (CapSense_CSD_SHIELD_SWITCH_RES << CSD_SW_RES_RES_HCBG_Pos))

    #define CapSense_CSD_SHIELD_GPIO_DM                 (CY_GPIO_DM_STRONG_IN_OFF)
    #define CapSense_CSD_SENSOR_HSIOM_SEL               (CapSense_HSIOM_SEL_CSD_SENSE)
    #define CapSense_CSD_SHIELD_HSIOM_SEL               (CapSense_HSIOM_SEL_CSD_SHIELD)
    #define CapSense_CSD_CMOD_HSIOM_SEL                 (CapSense_HSIOM_SEL_AMUXA)

    #define CapSense_DEFAULT_IDACA_BALL_MODE            (CapSense_CSD_IDACA_BALL_MODE_FULL <<\
                                                                 CapSense_CSD_IDACA_BALL_MODE_POS)
    #define CapSense_DEFAULT_IDACB_BALL_MODE            (CapSense_CSD_IDACB_BALL_MODE_FULL <<\
                                                                 CapSense_CSD_IDACB_BALL_MODE_POS)

    #define CapSense_DEFAULT_SENSE_DUTY_SEL             (0x00000000uL)

#elif(CapSense_SENSING_LOW_EMI == CapSense_CSD_SENSING_METHOD)

    #if (CapSense_ENABLE == CapSense_CSD_AUTO_ZERO_EN)
        /* Enable CSDCMP */
        #define CapSense_CSD_CSDCMP_SCAN                (CapSense_CSD_CSDCMP_CSDCMP_EN_MSK  |\
                                                                 CapSense_CSD_CSDCMP_CMP_PHASE_PHI2 |\
                                                                 CapSense_CSD_CSDCMP_AZ_EN_MSK)
    #else
        /* Enable CSDCMP */
        #define CapSense_CSD_CSDCMP_SCAN                (CapSense_CSD_CSDCMP_CSDCMP_EN_MSK |\
                                                                 CapSense_CSD_CSDCMP_CMP_PHASE_PHI2)
    #endif /* (CapSense_ENABLE == CapSense_CSD_AUTO_ZERO_EN) */

    #if(CapSense_ENABLE == CapSense_CSD_SHIELD_EN)
        #define CapSense_CSD_SW_HS_P_SEL_SCAN               (CapSense_CSD_SW_HS_P_SEL_SW_HMMB_STATIC_CLOSE)
    #else
        #define CapSense_CSD_SW_HS_P_SEL_SCAN               (CapSense_CSD_SW_HS_P_SEL_SW_HMMB_STATIC_OPEN)
    #endif /* (CapSense_ENABLE == CapSense_CSD_SHIELD_EN) */

    #if (CapSense_CSD__CMOD_PAD == CapSense_CMOD_CONNECTION)
        #define CapSense_CSD_SW_FW_MOD_SEL_SCAN             (CapSense_CSD_SW_FW_MOD_SEL_SW_F1PM_STATIC_CLOSE |\
                                                                     CapSense_CSD_SW_FW_MOD_SEL_SW_F1CA_PHI2)
        #define CapSense_CSD_SW_FW_TANK_SEL_SCAN            (0x00000000uL)
    #else
        #define CapSense_CSD_SW_FW_MOD_SEL_SCAN             (0x00000000uL)
        #define CapSense_CSD_SW_FW_TANK_SEL_SCAN            (CapSense_CSD_SW_FW_TANK_SEL_SW_F2PT_STATIC_CLOSE |\
                                                                     CapSense_CSD_SW_FW_TANK_SEL_SW_F2CA_PHI2)
    #endif /* (CapSense_CSD__CMOD_PAD == CapSense_CMOD_CONNECTION) */

    #if(CapSense_ENABLE == CapSense_CSD_SHIELD_EN)
        #if(CapSense_IDAC_SINKING != CapSense_CSD_IDAC_CONFIG)
            #define CapSense_CSD_SW_SHIELD_SEL_SCAN             (CapSense_CSD_SW_SHIELD_SEL_SW_HCBV_PHI2_HSCMP | CapSense_CSD_SW_SHIELD_SEL_SW_HCBG_PHI1 | CapSense_CSD_SW_SHIELD_SEL_SW_HCAG_PHI1)
        #else
            #define CapSense_CSD_SW_SHIELD_SEL_SCAN             (CapSense_CSD_SW_SHIELD_SEL_SW_HCBV_PHI1 | CapSense_CSD_SW_SHIELD_SEL_SW_HCBG_PHI2_HSCMP | CapSense_CSD_SW_SHIELD_SEL_SW_HCAV_PHI1)
        #endif /* (CapSense_IDAC_SINKING == CapSense_CSD_IDAC_CONFIG) */
    #else
        #if(CapSense_IDAC_SINKING != CapSense_CSD_IDAC_CONFIG)
            #define CapSense_CSD_SW_SHIELD_SEL_SCAN             (CapSense_CSD_SW_SHIELD_SEL_SW_HCAG_PHI1)
        #else
            #define CapSense_CSD_SW_SHIELD_SEL_SCAN             (CapSense_CSD_SW_SHIELD_SEL_SW_HCAV_PHI1)
        #endif /* (CapSense_IDAC_SINKING == CapSense_CSD_IDAC_CONFIG) */
    #endif /* (CapSense_ENABLE == CapSense_CSD_SHIELD_EN) */

    #define CapSense_CSD_SW_RES_INIT                    ((CapSense_CSD_F1PM_SWITCH_RES_LE_INIT << CSD_SW_RES_RES_F1PM_Pos) |\
                                                                 (CapSense_CSD_F2PT_SWITCH_RES_LE_INIT << CSD_SW_RES_RES_F2PT_Pos) |\
                                                                 (CapSense_CSD_HCAG_SWITCH_RES_LE_INIT << CSD_SW_RES_RES_HCAG_Pos) |\
                                                                 (CapSense_CSD_HCAV_SWITCH_RES_LE_INIT << CSD_SW_RES_RES_HCAV_Pos) |\
                                                                 (CapSense_CSD_HCBG_SWITCH_RES_LE_INIT << CSD_SW_RES_RES_HCBG_Pos) |\
                                                                 (CapSense_CSD_HCBV_SWITCH_RES_LE_INIT << CSD_SW_RES_RES_HCBV_Pos))

    #define CapSense_CSD_SW_RES_SCAN                    ((CapSense_CSD_F1PM_SWITCH_RES_LE_SCAN << CSD_SW_RES_RES_F1PM_Pos) |\
                                                                 (CapSense_CSD_F2PT_SWITCH_RES_LE_SCAN << CSD_SW_RES_RES_F2PT_Pos) |\
                                                                 (CapSense_CSD_HCAG_SWITCH_RES_LE_SCAN << CSD_SW_RES_RES_HCAG_Pos) |\
                                                                 (CapSense_CSD_HCAV_SWITCH_RES_LE_SCAN << CSD_SW_RES_RES_HCAV_Pos) |\
                                                                 (CapSense_CSD_HCBG_SWITCH_RES_LE_SCAN << CSD_SW_RES_RES_HCBG_Pos) |\
                                                                 (CapSense_CSD_HCBV_SWITCH_RES_LE_SCAN << CSD_SW_RES_RES_HCBV_Pos))

    #define CapSense_CSD_SHIELD_GPIO_DM                 (CY_GPIO_DM_ANALOG)
    #define CapSense_CSD_SENSOR_HSIOM_SEL               (CapSense_HSIOM_SEL_AMUXA)
    #define CapSense_CSD_SHIELD_HSIOM_SEL               (CapSense_HSIOM_SEL_AMUXB)
    #define CapSense_CSD_CMOD_HSIOM_SEL                 (CapSense_HSIOM_SEL_GPIO)

    #define CapSense_DEFAULT_IDACA_BALL_MODE            (CapSense_CSD_IDACA_BALL_MODE_PHI2 <<\
                                                                 CapSense_CSD_IDACA_BALL_MODE_POS)
    #define CapSense_DEFAULT_IDACB_BALL_MODE            (CapSense_CSD_IDACB_BALL_MODE_FULL <<\
                                                                 CapSense_CSD_IDACB_BALL_MODE_POS)

    #if(CapSense_IDAC_SINKING != CapSense_CSD_IDAC_CONFIG)
        #define CapSense_DEFAULT_SENSE_DUTY_SEL             (0x00000000uL)
    #else
        #define CapSense_DEFAULT_SENSE_DUTY_SEL             (CapSense_CSD_SENSE_DUTY_SENSE_POL_MSK)
    #endif /* (CapSense_IDAC_SINKING != CapSense_CSD_IDAC_CONFIG) */

