sparkfun/Pioneer_IoT_Kit_Shield/Firmware/BLE_To_RPi/BLE_To_RPi.cydsn/Generated_Source/PSoC6/CapSense_SensingCSD_LL.h
#elif(CapSense_SENSING_FULL_WAVE == CapSense_CSD_SENSING_METHOD)
#else
    #error "Not supported sensing method."
#endif /* (CapSense_SENSING_LEGACY == CapSense_CSD_SENSING_METHOD) */


/***************************************
* API Constants
***************************************/
/* Definition of time interval that is enough for charging 100nF capacitor */
#define CapSense_CSD_AVG_CYCLES_PER_LOOP                    (5u)
#define CapSense_CSD_MAX_CHARGE_TIME_US                     (100u)
#define CapSense_CSD_PRECHARGE_WATCHDOG_CYCLES_NUM          (((CapSense_CPU_CLOCK_FREQ_MHZ) * (CapSense_CSD_MAX_CHARGE_TIME_US)) /\
                                                                        (CapSense_CSD_AVG_CYCLES_PER_LOOP))

#define CapSense_CSD_IDAC_MOD_BITS_USED                     (7u)
#define CapSense_CAL_MIDDLE_BIT                             (1u << (CapSense_CSD_IDAC_MOD_BITS_USED - 1u))
#define CapSense_MAX_16_BITS_VALUE                          (0x0000FFFFLu)
#define CapSense_MAX_SCAN_TIME                              (CapSense_MAX_16_BITS_VALUE * CapSense_CSD_SCANSPEED_DIVIDER)
#define CapSense_CALIBR_WATCHDOG_CYCLES_NUM                 (CapSense_MAX_SCAN_TIME / CapSense_CSD_AVG_CYCLES_PER_LOOP)

#define CapSense_DELAY_EXTRACYCLES_NUM                      (9u)

/* Calibration constants */
#define CapSense_IDAC_MOD_MAX_CALIB_ERROR                   (10u)

#if (CapSense_IDAC_GAIN_8X == CapSense_CSD_IDAC_GAIN)
    #define CapSense_CSD_IDAC_GAIN_VALUE_NA                 (2400u)
#elif (CapSense_IDAC_GAIN_HIGH == CapSense_CSD_IDAC_GAIN)
    #define CapSense_CSD_IDAC_GAIN_VALUE_NA                 (2400u)
#elif (CapSense_IDAC_GAIN_4X == CapSense_CSD_IDAC_GAIN)
    #define CapSense_CSD_IDAC_GAIN_VALUE_NA                 (1200u)
#elif (CapSense_IDAC_GAIN_MEDIUM == CapSense_CSD_IDAC_GAIN)
    #define CapSense_CSD_IDAC_GAIN_VALUE_NA                 (300u)
#else
    #define CapSense_CSD_IDAC_GAIN_VALUE_NA                 (37u)
#endif /* (CapSense_IDAC_GAIN_8X == CapSense_CSD_IDAC_GAIN) */

#if (CapSense_ENABLE == CapSense_CSD_IDAC_COMP_EN)
    #define CapSense_CSD_DUAL_IDAC_FACTOR                   (2u)
#else
    #define CapSense_CSD_DUAL_IDAC_FACTOR                   (1u)
#endif /* (CapSense_ENABLE == CapSense_CSD_IDAC_COMP_EN) */

/* Defining the drive mode of pins depending on the Inactive sensor connection setting in the component customizer. */
#if(CapSense_SNS_CONNECTION_GROUND == CapSense_CSD_INACTIVE_SNS_CONNECTION)
    #define CapSense_CSD_INACTIVE_SNS_GPIO_DM               (CY_GPIO_DM_STRONG)
#elif(CapSense_SNS_CONNECTION_HIGHZ == CapSense_CSD_INACTIVE_SNS_CONNECTION)
    #define CapSense_CSD_INACTIVE_SNS_GPIO_DM               (CY_GPIO_DM_ANALOG)
#elif(CapSense_SNS_CONNECTION_SHIELD == CapSense_CSD_INACTIVE_SNS_CONNECTION)
    #define CapSense_CSD_INACTIVE_SNS_GPIO_DM               (CY_GPIO_DM_STRONG_IN_OFF)
#else
    #error "Unsupported inactive connection for the inactive sensors."
#endif /* (CapSense_SNS_CONNECTION_GROUND == CapSense_CSD_INACTIVE_SNS_CONNECTION) */


/* Clock Source Mode */
#if (CapSense_CLK_SOURCE_DIRECT == CapSense_CSD_SNS_CLK_SOURCE)
    #define CapSense_DEFAULT_MODULATION_MODE                (CapSense_CLK_SOURCE_DIRECT)
#elif (CapSense_CLK_SOURCE_PRSAUTO == CapSense_CSD_SNS_CLK_SOURCE)
    #define CapSense_DEFAULT_MODULATION_MODE                (CapSense_CLK_SOURCE_SSC2)
#elif ((CapSense_CLK_SOURCE_PRS8) == CapSense_CSD_SNS_CLK_SOURCE)
    #define CapSense_DEFAULT_MODULATION_MODE                (CapSense_CSD_SNS_CLK_SOURCE)
#elif ((CapSense_CLK_SOURCE_PRS12) == CapSense_CSD_SNS_CLK_SOURCE)
    #define CapSense_DEFAULT_MODULATION_MODE                (CapSense_CSD_SNS_CLK_SOURCE)
#else
    #define CapSense_DEFAULT_MODULATION_MODE                (CapSense_CSD_SNS_CLK_SOURCE)
#endif /* (CapSense_CLK_SOURCE_DIRECT != CapSense_CSD_SNS_CLK_SOURCE) */

/* IDACs Ranges */
#if (CapSense_IDAC_GAIN_LOW == CapSense_CSD_IDAC_GAIN)
    #define CapSense_DEFAULT_IDACA_RANGE                    (CapSense_CSD_IDACA_RANGE_IDAC_LO << CapSense_CSD_IDACA_RANGE_POS)
    #define CapSense_DEFAULT_IDACB_RANGE                    (CapSense_CSD_IDACB_RANGE_IDAC_LO << CapSense_CSD_IDACB_RANGE_POS)
#elif (CapSense_IDAC_GAIN_MEDIUM == CapSense_CSD_IDAC_GAIN)
    #define CapSense_DEFAULT_IDACA_RANGE                    (CapSense_CSD_IDACA_RANGE_IDAC_MED << CapSense_CSD_IDACA_RANGE_POS)
    #define CapSense_DEFAULT_IDACB_RANGE                    (CapSense_CSD_IDACB_RANGE_IDAC_MED << CapSense_CSD_IDACB_RANGE_POS)
#else
    #define CapSense_DEFAULT_IDACA_RANGE                    (CapSense_CSD_IDACA_RANGE_IDAC_HI << CapSense_CSD_IDACA_RANGE_POS)
    #define CapSense_DEFAULT_IDACB_RANGE                    (CapSense_CSD_IDACB_RANGE_IDAC_HI << CapSense_CSD_IDACB_RANGE_POS)
#endif

/* IDACs Polarities */
#if (CapSense_IDAC_SINKING == CapSense_CSD_IDAC_CONFIG)
    #define CapSense_DEFAULT_IDACA_POLARITY                 (CapSense_CSD_IDACA_POLARITY_VDDA_SNK << CapSense_CSD_IDACA_POLARITY_POS)
    #define CapSense_DEFAULT_IDACB_POLARITY                 (CapSense_CSD_IDACB_POLARITY_VDDA_SNK << CapSense_CSD_IDACB_POLARITY_POS)
#else
    #define CapSense_DEFAULT_IDACA_POLARITY                 (CapSense_CSD_IDACA_POLARITY_VSSA_SRC << CapSense_CSD_IDACA_POLARITY_POS)
    #define CapSense_DEFAULT_IDACB_POLARITY                 (CapSense_CSD_IDACB_POLARITY_VSSA_SRC << CapSense_CSD_IDACB_POLARITY_POS)
#endif /*  (CapSense_IDAC_SINKING == CapSense_CSD_IDAC_CONFIG) */


#if(CapSense_CSD_VREF_SRSS != CapSense_CSD_VREF_SOURCE)
    #define CapSense_CSD_SW_REFGEN_VREF_SRC                 (CapSense_CSD_SW_REFGEN_SEL_SW_SGRP_MSK)
#else
    #define CapSense_CSD_SW_REFGEN_VREF_SRC                 (CapSense_CSD_SW_REFGEN_SEL_SW_SGR_MSK)
#endif /* (CapSense_CSD_VREF_SRSS != CapSense_CSD_VREF_SOURCE) */


/* IDAC legs configuration */
#if ((CapSense_ENABLE == CapSense_CSD_IDAC_COMP_EN) && \
     (CapSense_ENABLE == CapSense_CSD_DEDICATED_IDAC_COMP_EN))
        #define CapSense_DEFAULT_SW_REFGEN_SEL              (CapSense_CSD_SW_REFGEN_VREF_SRC | CapSense_CSD_SW_REFGEN_SEL_SW_IAIB_MSK)
        #define CapSense_DEFAULT_IDACB_LEG1_MODE            (CapSense_CSD_IDACB_LEG1_EN_MSK |\
                                                                    (CapSense_CSD_IDACB_LEG1_MODE_CSD_STATIC << CapSense_CSD_IDACB_LEG1_MODE_POS))
#else
        #define CapSense_DEFAULT_SW_REFGEN_SEL              (CapSense_CSD_SW_REFGEN_VREF_SRC)
        #define CapSense_DEFAULT_IDACB_LEG1_MODE            (CapSense_CSD_IDACB_LEG1_MODE_GP_STATIC << CapSense_CSD_IDACB_LEG1_MODE_POS)
#endif /* ((CapSense_ENABLE == CapSense_CSD_IDAC_COMP_EN) && \
           (CapSense_ENABLE == CapSense_CSD_DEDICATED_IDAC_COMP_EN)) */


#if ((CapSense_ENABLE == CapSense_CSD_IDAC_COMP_EN) && \
     (CapSense_DISABLE == CapSense_CSD_DEDICATED_IDAC_COMP_EN))
        #define CapSense_DEFAULT_IDACB_LEG2_MODE            (CapSense_CSD_IDACA_LEG2_EN_MSK |\
                                                                    (CapSense_CSD_IDACA_LEG2_MODE_CSD_STATIC << CapSense_CSD_IDACA_LEG2_MODE_POS))
#else
        #define CapSense_DEFAULT_IDACB_LEG2_MODE            (CapSense_CSD_IDACA_LEG2_MODE_GP_STATIC << CapSense_CSD_IDACA_LEG2_MODE_POS)
#endif /* ((CapSense_ENABLE == CapSense_CSD_IDAC_COMP_EN) && \
        (CapSense_DISABLE == CapSense_CSD_DEDICATED_IDAC_COMP_EN)) */

/* IDACs register configuration is based on the component configuration */
#define CapSense_IDAC_MOD_DEFAULT_CFG                       (CapSense_DEFAULT_IDACA_RANGE | \
                                                                     CapSense_DEFAULT_IDACA_POLARITY | \
                                                                     CapSense_DEFAULT_IDACA_BALL_MODE | \
                                                                    (CapSense_CSD_IDACA_LEG1_MODE_CSD << CapSense_CSD_IDACA_LEG1_MODE_POS) | \
                                                                     CapSense_CSD_IDACA_LEG1_EN_MSK | \
                                                                     CapSense_DEFAULT_IDACB_LEG2_MODE)

