sparkfun/Pioneer_IoT_Kit_Shield/Firmware/BLE_To_RPi/BLE_To_RPi.cydsn/Generated_Source/PSoC6/CapSense_SensingCSD_LL.h
#define CapSense_IDAC_COMP_DEFAULT_CFG                      (CapSense_DEFAULT_IDACB_RANGE | \
                                                                     CapSense_DEFAULT_IDACB_POLARITY | \
                                                                     CapSense_DEFAULT_IDACB_BALL_MODE | \
                                                                     CapSense_DEFAULT_IDACB_LEG1_MODE | \
                                                                    (CapSense_CSD_IDACB_LEG2_MODE_GP_STATIC << CapSense_CSD_IDACB_LEG2_MODE_POS))

#define CapSense_IDAC_MOD_CALIBRATION_CFG                   (CapSense_DEFAULT_IDACA_RANGE | \
                                                                     CapSense_DEFAULT_IDACA_POLARITY | \
                                                                     CapSense_DEFAULT_IDACA_BALL_MODE | \
                                                                    (CapSense_CSD_IDACA_LEG1_MODE_CSD << CapSense_CSD_IDACA_LEG1_MODE_POS) | \
                                                                     CapSense_CSD_IDACA_LEG1_EN_MSK | \
                                                                    (CapSense_CSD_IDACA_LEG2_MODE_GP_STATIC << CapSense_CSD_IDACA_LEG2_MODE_POS))

#define CapSense_IDAC_COMP_CALIBRATION_CFG                  (CapSense_DEFAULT_IDACB_RANGE | \
                                                                     CapSense_DEFAULT_IDACB_POLARITY | \
                                                                     CapSense_DEFAULT_IDACB_BALL_MODE | \
                                                                    (CapSense_CSD_IDACB_LEG1_MODE_GP_STATIC << CapSense_CSD_IDACB_LEG1_MODE_POS) | \
                                                                    (CapSense_CSD_IDACB_LEG2_MODE_GP_STATIC << CapSense_CSD_IDACB_LEG2_MODE_POS))

/***************************************
* Global software variables
***************************************/

extern uint32 CapSense_configCsd;

#if (CapSense_ENABLE == CapSense_CSD_NOISE_METRIC_EN)
    extern uint8 CapSense_badConversionsNum;
#endif /* (CapSense_ENABLE == CapSense_CSD_NOISE_METRIC_EN) */


/***************************************
* Function Prototypes
**************************************/

/* Interrupt handler */
extern void CapSense_CSDPostSingleScan(void);
extern void CapSense_CSDPostMultiScan(void);

#if (CapSense_ENABLE == CapSense_CSD_GANGED_SNS_EN)
    extern void CapSense_CSDPostMultiScanGanged(void);
#endif /* (CapSense_ENABLE == CapSense_CSD_GANGED_SNS_EN) */


/**
* \if SECTION_CAPSENSE_LOW_LEVEL
* \addtogroup group_capsense_low_level
* \{
*/

void CapSense_CSDSetupWidget(uint32 widgetId);
void CapSense_CSDSetupWidgetExt(uint32 widgetId, uint32 sensorId);
void CapSense_CSDScan(void);
void CapSense_CSDScanExt(void);
#if ((CapSense_CSD_SS_DIS != CapSense_CSD_AUTOTUNE) || \
     (CapSense_ENABLE == CapSense_CSD_IDAC_AUTOCAL_EN))
    cy_status CapSense_CSDCalibrateWidget(uint32 widgetId, uint32 target);
#endif /* ((CapSense_CSD_SS_DIS != CapSense_CSD_AUTOTUNE) || \
           (CapSense_ENABLE == CapSense_CSD_IDAC_AUTOCAL_EN))  */
void CapSense_CSDConnectSns(CapSense_FLASH_IO_STRUCT const *snsAddrPtr);
void CapSense_CSDDisconnectSns(CapSense_FLASH_IO_STRUCT const *snsAddrPtr);

/** \}
* \endif */

/*****************************************************
* Function Prototypes - internal Low Level functions
*****************************************************/
/**
* \if SECTION_CAPSENSE_INTERNAL
* \addtogroup group_capsense_internal
* \{
*/

void CapSense_SsCSDInitialize(void);
void CapSense_SsCSDStartSample(void);
void CapSense_SsCSDSetUpIdacs(CapSense_RAM_WD_BASE_STRUCT const *ptrWdgt);
void CapSense_SsCSDConfigClock(void);
void CapSense_SsCSDElectrodeCheck(void);
#if ((CapSense_ENABLE == CapSense_CSD_SHIELD_EN) && \
     (0u != CapSense_CSD_TOTAL_SHIELD_COUNT))
    void CapSense_SsCSDDisableShieldElectrodes(void);
#endif /* ((CapSense_ENABLE == CapSense_CSD_SHIELD_EN) && \
           (0u != CapSense_CSD_TOTAL_SHIELD_COUNT)) */
uint32 CapSense_SsCSDGetNumberOfConversions(uint32 snsClkDivider, uint32 resolution, uint32 snsClkSrc);
void CapSense_SsCSDCalculateScanDuration(CapSense_RAM_WD_BASE_STRUCT const *ptrWdgt);
void CapSense_SsCSDConnectSensorExt(uint32 widgetId, uint32 sensorId);
void CapSense_SsCSDDisconnectSnsExt(uint32 widgetId, uint32 sensorId);

#if ((CapSense_CSD_SS_DIS != CapSense_CSD_AUTOTUNE) || \
     (CapSense_ENABLE == CapSense_SELF_TEST_EN) || \
     (CapSense_ENABLE == CapSense_CSD_IDAC_AUTOCAL_EN))
#endif /* ((CapSense_CSD_SS_DIS != CapSense_CSD_AUTOTUNE) || \
           (CapSense_ENABLE == CapSense_SELF_TEST_EN) || \
           (CapSense_ENABLE == CapSense_CSD_IDAC_AUTOCAL_EN)) */

/** \}
* \endif */

/***************************************
* Global software variables
***************************************/
extern uint32 CapSense_configCsd;
/* Interrupt handler */
extern void CapSense_CSDPostSingleScan(void);
extern void CapSense_CSDPostMultiScan(void);
#if (CapSense_ENABLE == CapSense_CSD_GANGED_SNS_EN)
extern void CapSense_CSDPostMultiScanGanged(void);
#endif /* (CapSense_ENABLE == CapSense_CSD_GANGED_SNS_EN) */
#if (CapSense_ENABLE == CapSense_CSD_NOISE_METRIC_EN)
    extern uint8 CapSense_badConversionsNum;
#endif /* (CapSense_ENABLE == CapSense_CSD_NOISE_METRIC_EN) */

#endif /* End CY_CAPSENSE_CapSense_SENSINGCSD_LL_H */


/* [] END OF FILE */
